Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: However, this pattern is counter-productive when using virtual threads. Virtual threads are not pooled and generally short-lived. So, instead of a few of them, we now have many of them. For each of them, the object stored in the `ThreadLocal` is created (often large and expensive) and won't be reused, as the virtual thread is not pooled (and won't be used to run another task once the execution completes). This problem leads to high memory usage. Unfortunately, it requires sophisticated code changes in the libraries themselves.
ja_jp: ただし、このパターンは仮想スレッドを使用する場合には逆効果になります。 仮想スレッドはプールされず、一般的に短命です。 そのため、少数のスレッドを使用するのではなく、大量のスレッドを扱うことになります。 それぞれのスレッドに対して、 `ThreadLocal` に格納されるオブジェクトが作成されます (多くの場合、サイズが大きく、コストもかかります)。しかし、仮想スレッドはプールされず (実行が完了した後に別のタスクを実行することもないため)、これらのオブジェクトは再利用されません。 この問題により、メモリー使用量が増加します。 残念ながら、この問題を解決するには、ライブラリー自体に高度なコード変更が必要になります。

source: However, thread locals are not propagated.
ja_jp: ただし、スレッドローカルは伝播されません。

source: However, to optimize runtime memory, Caffeine embarks many cache implementation classes that are selected depending on the cache configuration. We are not registering all of them for reflection (and the ones not registered are not included into the native executables) as registering all of them would be very costly.
ja_jp: 実行時の速度を最適化するために、Caffeineはキャッシュ設定に応じて選択される多くのキャッシュ実装クラスを組み込んでいます。すべてのクラスを登録するのは非常にコストがかかるため、リフレクションのためにすべてのクラスを登録していません（登録されていないクラスはネイティブ実行可能ファイルに含まれません）。

source: However, to optimize runtime speed, Caffeine embarks many cache implementation classes that are selected depending on the cache configuration. We are not registering all of them for reflection (and the ones not registered are not included into the native executables) as registering all of them would be very costly.
ja_jp: ランタイムの速度を最適化するために、Caffeineはキャッシュ構成に応じて選択される多くのキャッシュ実装クラスを組み込んでいます。すべてのクラスを登録するのは非常にコストがかかるため、リフレクションのためにすべてのクラスを登録していません（登録されていないクラスはネイティブ実行可能ファイルに含まれません）。

source: However, using a static tenant resolution (configuring tenants in `application.properties` and resolving them with `TenantResolver`) prevents testing the endpoint with `Dev Services for Keycloak` since `Dev Services for Keycloak` has no knowledge of how the requests will be mapped to individual tenants and can not dynamically provide tenant-specific `quarkus.oidc.<tenant-id>.auth-server-url` values and therefore using `%prod` prefixes with the tenant-specific URLs in `application.properties` will not work in tests or devmode.
ja_jp: しかし、静的なテナント解決（ `application.properties` でテナントを設定し、 `TenantResolver` で解決する）を使用すると、 `Dev Services for Keycloak` でエンドポイントをテストすることができません。 `Dev Services for Keycloak` は、リクエストが個々のテナントにどのようにマッピングされるかを知らないため、テナント固有の `quarkus.oidc.<tenant-id>.auth-server-url` 値を動的に提供できず、したがって `%prod` プレフィックスを使用して `application.properties` のテナントに固有の URL を使用するとテストや開発モードで動作しません。

source: However, using a static tenant resolution, which involves configuring tenants in `application.properties` and resolving them with `TenantResolver`, does not work for testing endpoints with Dev Services for Keycloak because it does not know how the requests are be mapped to individual tenants, and cannot dynamically provide tenant-specific `quarkus.oidc.<tenant-id>.auth-server-url` values. Therefore, using `%prod` prefixes with tenant-specific URLs within `application.properties` does not work in both test and development modes.
ja_jp: ただし、`application.properties` でテナントを設定し、`TenantResolver` を使用してこれらを解決する静的テナント解決を使用することは、Dev Services for Keycloak を使用したエンドポイントのテストには機能しません。これは、リクエストが個々のテナントにどのようにマッピングされるかがわからず、テナント固有の `quarkus.oidc.<tenant-id>.auth-server-url` の値を動的に提供できないためです。したがって、`application.properties` 内のテナント固有の URL に `%prod` 接頭辞を付けると、テストモードと開発モードの両方で機能しません。

source: However, when the claims are sensitive, their confidentiality can be guaranteed by following the steps described in the link:https://tools.ietf.org/html/rfc7516[JSON Web Encryption] specification to produce a JWT token with the encrypted claims.
ja_jp: ただし、クレームが機密である場合は、link:https://tools.ietf.org/html/rfc7516[JSON Web 暗号化] の仕様に記載されている手順に従って暗号化されたクレームを含む JWT を生成することにより、機密性を保証できます。

source: However, when using Maven, a Quarkus application is still a traditional `jar` Maven project. It follows the standard lifecycle for the `jar` packaging, which means Maven will also build a conventional JAR using the `maven-jar-plugin`.
ja_jp: しかし、Mavenを使用する場合、Quarkusアプリケーションは依然として従来の `jar` Mavenプロジェクトです。これは `jar` パッケージングの標準ライフサイクルに従うため、Mavenは `maven-jar-plugin` を使用して従来のJARもビルドします。

source: However, when working with a multi-module project, be sure to read the `Working with multi-module projects` section of the xref:maven-tooling.adoc#multi-module-maven[Maven] or xref:gradle-tooling.adoc#multi-module-gradle[Gradle] guides.
ja_jp: ただし、マルチモジュールプロジェクトで作業する場合は、 xref:maven-tooling.adoc#multi-module-maven[Maven] または xref:gradle-tooling.adoc#multi-module-gradle[Gradle] ガイドの `マルチモジュールプロジェクトでの作業` セクションを参照してください。

source: However, when working with a multi-module project, be sure to read the `Working with multi-module projects` section of the xref:maven-tooling.adoc#multi-module-maven[Maven] or xref:gradle-tooling.adoc#multi-module-maven[Gradle] guides.
ja_jp: しかし、マルチモジュールプロジェクトで作業する場合は、 link:maven-toolsing#multi-module-maven[Maven] または link:gradle-toolsing#multi-module-maven[Gradle] ガイドの `マルチモジュールプロジェクトでの作業` のセクションを必ず読んでください。

source: However, with this model, you need one thread for every concurrent request, which places a limit on the achievable concurrency. On the other side, the reactive execution model embraces asynchronous development models and non-blocking IO. With this model, multiple requests can be handled by the same thread. When the processing of a request can no longer make progress (because it requests a remote service, or interacts with a database for example), it uses non-blocking IO. Instead of blocking the thread, it schedules the operation and passes a continuation which would be invoked after the completion of the operationfootnote:[This article won’t detail how operating systems and non-blocking IO libraries enable such a model. Under the hood, kernel mechanisms such as select, epoll and ICMP are making the handling of IO very efficient, in terms of speed and resource utilization.]. This releases the thread immediately, which can then be used to serve another request. When the result of the IO operation is available, the processing of the request is resumed and continues its execution.
ja_jp: しかし、このモデルでは、同時実行リクエストごとに1つのスレッドが必要となり、達成可能な同時実行性に制限が生じます。一方、リアクティブ実行モデルでは、非同期開発モデルとノンブロッキング IO を採用しています。このモデルでは、複数のリクエストを同じスレッドで処理することができます。(リモートサービスをリクエストしたり、データベースと対話したりするために) リクエストの処理が進まなくなった場合は、ノンブロッキング IO を使用します。スレッドをブロックする代わりに、操作をスケジュールし、操作の完了後に呼び出される継続を渡します footnote:[この記事ではOSとノンブロッキング IO ライブラリがどのようにそういったモデルを実現しているかの詳細には踏み込みません。内部的に、select、epoll、ICMPといったカーネルメカニズムがIO処理をスピードとリソース利用の観点で非常に効率的にしています]。これによりスレッドはすぐに解放され、別のリクエストに対応するために使用することができます。IO 操作の結果が利用可能になると、リクエストの処理が再開され、その実行が継続されます。

source: However, you can change this default behavior and constrain a provider to:
ja_jp: しかし、このデフォルトの動作を変更してプロバイダを制約することができます。

source: However, you can go right to the completed example.
ja_jp: ただし、アプリケーションの完成例にそのまま進んでも構いません。

source: However, you can now see spans produced by the OpenTelemetry's auto-instrumentation instead of the OpenTracing one:
ja_jp: ただし、OpenTracing ではなく OpenTelemetry の自動計装によって生成されたスパンが表示されるようになりました。

source: HttpAuthenticationMechanism Customization
ja_jp: HttpAuthenticationMechanism のカスタマイズ

source: Human-readable text
ja_jp: 人間が読めるテキスト

source: I am hesitating between Quinoa and the Web Bundler, how should I make my decision?
ja_jp: Quinoa と Web Bundler のどちらにするか迷っています。どのように決めればよいでしょうか?

source: I am pleased to announce the release of https://github.com/a2aproject/a2a-java/releases/tag/v1.0.0.Alpha1[A2A Java SDK 1.0.0.Alpha1]. This release represents a significant milestone as we align with the upcoming 1.0 version of the https://github.com/a2aproject/A2A[Agent2Agent (A2A) Protocol specification]. Note that the specification itself is still being finalised, so there might be some subtle changes until the final 1.0 version.
ja_jp: https://github.com/a2aproject/a2a-java/releases/tag/v1.0.0.Alpha1[A2A Java SDK 1.0.0.Alpha1] のリリースを発表できることを嬉しく思います。このリリースは、今後の1.0バージョンの https://github.com/a2aproject/A2A[Agent2Agent (A2A) プロトコル仕様] に対応する重要なマイルストーンとなります。なお、仕様自体はまだ最終決定段階にあるため、最終的な1.0バージョンまでにいくつかの微妙な変更がある可能性があります。

source: I am very hopeful for the project. Can't wait to expand the use cases.
ja_jp: このプロジェクトにはとても期待しています。早くユースケースを広げたいですね。

source: I can hear someone in the room shouting:
ja_jp: 誰かが叫んでいるのが聞こえます。

source: I could mock it with the following class in `src/test/java`:
ja_jp: `src/test/java` で以下のクラスでモックできました:

source: I could write an article debunking these arguments and explain how the latter makes your development workflow much more efficient and how the former makes the latter possible, even if fast boots are not your thing. But for the sake of this blog post, let's admit these persons are absolutely right and these are not good reasons to use Quarkus.
ja_jp: たとえ高速起動が必要なくとも、後者がいかに開発ワークフローをより効率的にするか、また前者がいかに後者を可能にするかを説明し、これらの議論を否定する記事を書くこともできます。しかし、このブログ記事のために、これらの人たちが全く正しく、これらはQuarkusを使用する良い理由ではないとしましょう。

source: I don't need transaction when I do read only operations, it's faster.
ja_jp: 読み込み専用の操作をするときにはトランザクションは不要で、その方が早いですよね。

source: I don't understand the concept of client proxies.
ja_jp: クライアントプロキシーの概念が理解できません。

source: I finally have a full environment setup locally and I can understand what is going on. Now, I can find the bugs without having to wait at least.
ja_jp: 遂にローカルで完全な環境が整い、何が起こっているのか理解できるようになりました。これで、少なくとも待つことなく、バグを見つけることができます。

source: I find it amazing and want to thank the ~30 contributors who have helped to translate the website into these languages and continues to do so!
ja_jp: 私は、このウェブサイトをこれらの言語に翻訳し、今も翻訳を続けている30人の協力者に感謝したいと思います。

source: I get a `AnalysisError\$ParsingError` when building a native executable due to an `UnresolvedElementException`, what can I do?
ja_jp: ネイティブ実行可能ファイルをビルドする際に、 `UnresolvedElementException` が原因で `AnalysisError\$ParsingError` が表示されるのですが、どうすればよいでしょうか？

source: I get a warning about using experimental options, what can I do?
ja_jp: 実験的なオプションの使用に関する警告が表示されましたが、どうすればよいですか?

source: I get an `OutOfMemoryError` (OOME) building native executables, what can I do?
ja_jp: ネイティブ実行可能ファイルをビルドする際に OutOfMemoryError (OOME) が発生しました。どうすればよいですか?

source: I had the question multiple times: how do I use Eclipse Vert.x in Quarkus? Indeed, you can use Vert.x in Quarkus. You can deploy _verticles_, communicate with the event bus, or use anything from the Vert.x ecosystem. But, you can also use the Mutiny variant of Vert.x in Quarkus, and get a seamless experience with the other reactive APIs offered by Quarkus. Several posts have already mentioned this, but it deserves a specific blog post. So, here we are.
ja_jp: よく次の質問をされます:「QuarkusでEclipse Vert.xを使うにはどうすればいいですか?」確かに、QuarkusではVert.xを使用することができます。 _Verticles_ をデプロイしたり、イベントバスと通信したり、Vert.xエコシステムのものなら何でも使えます。しかし、QuarkusでVert.xのMutinyバリアントを使用して、Quarkusが提供する他のReactive APIとシームレスな体験を得ることもできます。これについてはすでにいくつかの記事で触れていますが、具体的なブログ記事に値する内容です。というわけで、ここで紹介します。

source: I have transformed a user class to add an injected field, but CDI isn't working
ja_jp: 挿入されたフィールドを追加するためにユーザークラスを変換しましたが、CDI が機能しません

source: I hope that by sharing our experience, we can inspire other projects, especially library and framework authors, to take a similar approach and improve their startup performance.
ja_jp: 私たちの経験を共有することで、他のプロジェクト、特にライブラリーやフレームワークの作者が同様のアプローチをとり、起動パフォーマンスを向上させるきっかけになれば幸いです。

source: I identified this issue some time ago, and our colleague Luca Molteni from the Hibernate team will be looking into it soon. We're not yet sure how easy it will be to fix, but you get the idea. Whenever possible, this kind of metadata should be resolved once and for all. And you should be able to enforce its correctness with tests to ensure it remains accurate and up to date.
ja_jp: 私は少し前にこの問題を特定し、Hibernate チームの同僚である Luca Molteni が近いうちに調査する予定です。修正がどれほど容易かはまだわかりませんが、要旨は理解していただけるでしょう。可能な限り、この種のメタデータは一度だけで完全に解決されるべきです。そして、テストによってその正確さを強制し、正確で最新の状態を維持できるようにすべきです。

source: I just deployed all 10 of them again.
ja_jp: 今、改めて10人全員を配置しました。

source: I mentioned that with Quarkus, there was no trade-off between startup time and performance. When compared to other frameworks, this is definitely true. The internal efficiencies of Quarkus, like the build-time principle, improve both startup time _and_ throughput. But if you compare Quarkus on JVM against Quarkus native, the trade-off is back! When using GraalVM to compile Quarkus applications to native, Quarkus starts faster than a lightbulb, and has a pretty small memory footprint. But there _is_ a throughput penalty. Going native cuts throughput in half. (For Spring Boot, the native penalty is similar.) For most applications, this trade-off isn't worth it, especially when combined with the longer build times and extra constraints of native. But sometimes, the trade-off is worth it: if your application gets started and stopped super-often or has very low workloads, use native.
ja_jp: Quarkusでは、起動時間とパフォーマンスの間にトレードオフがないと述べました。他のフレームワークと比較した場合、これは確かに真実です。ビルド時の原則のようなQuarkusの内部効率は、起動時間 _と_ スループットの両方を改善します。しかし、JVM上のQuarkusをネイティブのQuarkusと比較すると、トレードオフが再び現れます！GraalVMを使用してQuarkusアプリケーションをネイティブにコンパイルすると、Quarkusは電球よりも速く起動し、非常に小さなメモリフットプリントを持っています。しかし、スループットのペナルティ _はあります_ 。ネイティブにするとスループットは半分になります。（Spring Bootの場合、ネイティブのペナルティは同様です。）ほとんどのアプリケーションにとって、このトレードオフは価値がありません。特に、より長いビルド時間やネイティブの追加の制約と組み合わせるとそうです。しかし、時にはトレードオフに価値がある場合もあります。アプリケーションが非常に頻繁に起動および停止される場合や、非常に低いワークロードの場合は、ネイティブを使用してください。

source: I shared this journey with my dear colleague Georgios Andrianakis, who was also instrumental in making this happen. And this is exactly the kind of journey you want to share with someone.
ja_jp: 私はこの道のりを、親愛なる同僚である Georgios Andrianakis と共に歩みました。彼はこのプロジェクトを実現する上で極めて重要な役割を果たしました。これこそまさに、誰かと共有したくなるような素晴らしい道のりでした。

source: I think I’ve found a bug in native-image, how can I debug it with the IDE?
ja_jp: native-imageのバグを見つけたようなのですが、IDEでどのようにデバッグすればいいのでしょうか？

source: I truly value this kind of feedback: it not only helps us identify areas for improvement, but also provides a reproducible way to explore them.
ja_jp: この種​​のフィードバックは本当に貴重です。改善すべき領域を特定するのに役立つだけでなく、それらを探求するための再現可能な方法も提供してくれるからです。

source: I use Quarkus 2.x, do I need to update right away?
ja_jp: Quarkus 2.xを使用していますが、すぐにアップデートする必要がありますか？

source: I wished there was a way to define mock alternatives per test through annotation, but this was answered in https://groups.google.com/g/quarkus-dev/c/IBojyD1BplY/m/NWFmsX3NBwAJ[this thread]
ja_jp: アノテーションでテストごとにモックを定義する方法があればと思いましたが、これは link:https://groups.google.com/g/quarkus-dev/c/IBojyD1BplY/m/NWFmsX3NBwAJ[このスレッド]で回答されています。

source: I won't go into detail on the Quarkus build process but the principle of it is extremely simple:
ja_jp: Quarkusのビルドプロセスの詳細は省きますが、その原理は極めてシンプルです。

source: I'll let the stage to Stuart Douglas for that one as he's the author of this amazing new feature.
ja_jp: この素晴らしい新機能を開発したのはStuart Douglas氏なので、彼にお任せします。

source: I'm a patient person. But you only get so many mouse clicks per day.
ja_jp: 私は忍耐強い人間です。しかし、1 日にマウスをクリックできる回数には限りがあります。

source: I'm working with CDI, and I don't know how to ...
ja_jp: CDI を使用していますが、方法がわかりません...

source: I.e. if you wanted to add the `smallrye-openapi` and `swagger-ui` extensions and have the Swagger UI always show up you would add the following:
ja_jp: 例えば、 `smallrye-openapi` と `swagger-ui` のエクステンションを追加して Swagger UI を常に表示させたい場合は、以下のように追加します。

source: I/O is an essential part of almost any modern system. Whether it is to call a remote service, interact with a database, or send messages to a broker, there are all I/O-based operations. Efficiently handling them is critical to avoid greedy applications. For this reason, Quarkus uses non-blocking I/O, which allows a low number of OS threads to manage many concurrent I/Os. As a result, Quarkus applications allow for higher concurrency, use less memory, and improve the deployment density.
ja_jp: I/Oは、ほぼすべての現代のシステムに不可欠な要素です。リモートサービスの呼び出し、データベースとのやりとり、ブローカーへのメッセージ送信など、全てI/Oベースの操作です。それらを効率的に処理することは、貪欲なアプリケーションを避けるために重要です。このため、QuarkusではノンブロッキングI/Oを使用しています。これにより、少ない数のOSスレッドで多数の同時I/Oを管理できます。その結果、Quarkusのアプリケーションは、より高い同時実行性を可能にし、より少ないメモリしか使用せず、デプロイ密度が向上します。

source: I/O thread
ja_jp: I/Oスレッド

source: I18N for Dev UI
ja_jp: Dev UIのI18N

source: ID Generator
ja_jp: ID ジェネレーター

source: ID Token is always a JWT token and is used to represent a user authentication with the JWT claims. One can access ID Token claims by injecting `JsonWebToken` with an `IdToken` qualifier:
ja_jp: ID トークン は常に JWT トークンであり、JWT クレームでユーザー認証を表現するために使用されます。 `JsonWebToken` に `IdToken` という修飾子をつけて注入することで、ID トークンクレームにアクセスすることができます。

source: ID and access `JWT` tokens are verified with the refreshable `JWK` key set but both JWT and opaque (binary) tokens can be introspected remotely.
ja_jp: ID とアクセス `JWT` トークンは、リフレッシュ可能な `JWK` キーセットで検証されますが、JWT と不透明な (バイナリーの) トークンの両方をリモートで検証することができます。

source: ID and access tokens may have to be decrypted or their headers preprocessed for the verification process to start and succeed.
ja_jp: ID トークンやアクセストークンは、検証プロセスを開始して成功させるために、復号化したりヘッダーを前処理したりする必要がある場合があります。

source: ID token availability
ja_jp: ID トークンの可用性

source: ID token: The Quarkus `web-app` application uses the user information in the ID token to enable the authenticated user to log in securely and to provide role-based access to the web application.
ja_jp: IDトークン: Quarkus `web-app` アプリケーションは、ID トークンのユーザー情報を使用して、認証されたユーザーが安全にログインできるようにし、Web アプリケーションにロールベースのアクセスを提供します。

source: ID token: The Quarkus web-app uses the user information in the ID token to enable the authenticated user to log in securely and to provide role-based access to the web-app.
ja_jp: ID トークン: Quarkus ウェブアプリは ID トークン内のユーザー情報を使用して、認証されたユーザーが安全にログインできるようにし、ウェブアプリへのロールベースのアクセスを提供します。

source: ID type
ja_jp: ID 型

source: IDE link
ja_jp: IDE リンク

source: IDE support tips
ja_jp: IDE サポートのヒント

source: IDs are often a touchy subject, and not everyone's up for letting them handled by the framework, once again we have you covered.
ja_jp: IDは微妙な問題で、誰もがフレームワークに任せることができるわけではありませんが、今回も私たちはカバーします。

source: IDs are often a touchy subject. In MongoDB, they are usually auto-generated by the database with an `ObjectId` type. In MongoDB with Panache the ID are defined by a field named `id` of the `org.bson.types.ObjectId` type, but if you want to customize them, once again we have you covered.
ja_jp: ID はしばしば微妙な問題です。MongoDBでは、IDは通常、 `ObjectId` 型でデータベースによって自動生成されます。MongoDB with Panacheでは、IDは `org.bson.types.ObjectId` 型の `id` というフィールドで定義されていますが、もしカスタマイズしたいのであれば、私たちがサポートします。

source: INFO footnote:[Some extensions may define customized default log levels for certain categories, in order to reduce log noise by default. Setting the log level in configuration will override any extension-defined log levels.]
ja_jp: INFO footnote:[いくつかのエクステンションは、ログノイズを削減するために、特定のカテゴリに対してカスタマイズされたデフォルトログレベルを定義しているかもしれません。コンフィグレーションでのログレベル設定は、エクステンション定義のログレベルをオーバーライドします。]

source: INFO footnote:[Some extensions might define customized default log levels for certain categories to reduce log noise by default. Setting the log level in configuration will override any extension-defined log levels.]
ja_jp: INFO footnote:[一部のエクステンションでは、デフォルトでログノイズを減らすために、特定のカテゴリーに対してカスタマイズされたデフォルトのログレベルが定義される場合があります。 設定でログレベルを設定すると、エクステンションで定義されたログレベルが上書きされます。

source: IP detection
ja_jp: IP 検出

source: Ideally both the session and state cookies have the same `Same-Site` attribute value, however having the same `Same-Site` `strict` value for both cookies also proved to be problematic in some cases.
ja_jp: 理想的にはセッション Cookie と State Cookie の両方が同じ `Same-Site` 属性値を持つべきですが、両方の Cookie に同じ `Same-Site` `strict` 値を持たせると、場合によっては問題が発生することも判明しています。

source: Identifier of a CDI bean that provides the default Kafka consumer/producer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier. Type: _string_
ja_jp: このチャネルのデフォルトの Kafka コンシューマー/プロデューサー設定を提供する CDIBean の ID。チャネル設定は、引き続き任意の属性をオーバーライドできます。Bean には、ある種のマップ<String, Object> が必要です。また、識別子を設定するには、@io.smallrye.common.annotation.Identifier 修飾子を使用する必要があります。 Type: _string_

source: Identifier of a CDI bean that provides the default Pulsar client configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
ja_jp: このチャネルのデフォルトPulsarクライアント設定を提供するCDI Beanの識別子。チャネル構成は、任意の属性をオーバーライドすることができます。BeanはMap<String, Object>型を持ち、@io.smallrye.common.annotation.Identifierアノテーションを使用して識別子を設定する必要があります。

source: Identifier of a CDI bean that provides the default Pulsar consumer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
ja_jp: このチャネルのデフォルトPulsarコンシューマ設定を提供するCDI Beanの識別子。チャネル構成は、任意の属性をオーバーライドすることができます。BeanはMap<String, Object>型を持ち、@io.smallrye.common.annotation.Identifierアノテーションを使用して識別子を設定する必要があります。

source: Identifier of a CDI bean that provides the default Pulsar producer configuration for this channel. The channel configuration can still override any attribute. The bean must have a type of Map<String, Object> and must use the @io.smallrye.common.annotation.Identifier qualifier to set the identifier.
ja_jp: このチャネルのデフォルトPulsarプロデューサー設定を提供するCDI Beanの識別子。チャネル設定は、任意の属性をオーバーライドすることができます。BeanはMap<String, Object>型を持ち、@io.smallrye.common.annotation.Identifierアノテーションを使用して識別子を設定する必要があります。

source: Identifiers and Tags
ja_jp: 識別子とタグ

source: Identifiers are used in expressions and section tags. A valid identifier is a sequence of non-whitespace characters. However, users are encouraged to only use valid Java identifiers in expressions.
ja_jp: 識別子は、式やセクションタグで使用されます。有効な識別子は、空白文字以外の文字列です。ただし、式の中では有効な Java 識別子のみを使用することが推奨されます。

source: Identifies response headers that clients can access.
ja_jp: クライアントがアクセスできる応答ヘッダーを識別します。

source: Identifies the client application within the Keycloak realm.
ja_jp: Keycloak レルム内のクライアントアプリケーションを識別します。

source: Identifying Requests
ja_jp: リクエストの特定

source: Identity
ja_jp: アイデンティティ

source: Identity Example
ja_jp: アイデンティティの例

source: Identity Providers
ja_jp: アイデンティティ・プロバイダー

source: Identity providers
ja_jp: アイデンティティ・プロバイダー

source: If `configuration-resource`, `configuration` and `configuration-uri` are configured for the same cache with the same Quarkus profile, `configuration-uri` gets the highest preference, over `configuration-resource` and `configuration`. `configuration-resource` gets preference over `configuration`.
ja_jp: `configuration-resource` 、 `configuration` 、 `configuration-uri` が同じQuarkusプロファイルで同じキャッシュに設定されている場合、 `configuration-uri` が `configuration-resource` 、 `configuration` よりも優先されます。 `configuration-resource` は `configuration` よりも優先されます。

source: If HTML `form` tags are not used and you need to pass CSRF token as a header, then inject the header name and token, for example, into HTMX:
ja_jp: HTML `form` タグを使用せず、CSRFトークンをヘッダーとして渡す必要がある場合、例えばHTMXにヘッダー名とトークンを注入します：

source: If I want my extension to be in code.quarkus.io, does it have to be in the Quarkiverse GitHub org?
ja_jp: エクステンションを code.quarkus.io に配置したい場合、Quarkiverse GitHub org に配置する必要がありますか?
